src/config/DataProcessors/СообщениеРуководителюОПДЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СообщениеРуководителюОПДЗ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчитыватьВзимныеОбязательства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателяСезонный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоПрессФормам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/InformationRegisters/СудебныеРазбирательстваСДебиторами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СудебныеРазбирательстваСДебиторами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПередачиДокументовВЮрОтдел</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаСудебногоПроцесса</Name>
					<Comment>Дата передачи документов в суд</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияСудебногоПроцесса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатСудебногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСудебныхПроцессовСДебиторами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Enums/ВидыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыЗадолженности</Name>
			<Comment>Виды задолженности: дебиторская, кредиторская</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
					<Comment>Дебиторская</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
					<Comment>Кредиторская</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Documents/УправленческийЗачетВзаимныхОбязательств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УправленческийЗачетВзаимныхОбязательств</Name>
			<Comment>(Общ)</Comment>
			<BasedOn>
				<xr:Item>Document.УправленческийЗачетВзаимныхОбязательств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДебитор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагентаДебитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентКредитор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагентаКредитора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СуммыДолга</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
								<v8:Type>cfg:DocumentRef.УправленческийЗачетВзаимныхОбязательств</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ) Сумма изменения долга контрагента в валюте взаиморасчетов со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЗадолженности</Name>
							<Comment>(Общ.) Вид задолженности: дебеторская, кредиторская</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/DataProcessors/СообщениеРуководителюОПДЗ/Ext/ObjectModule.bsl
Функция ПолучитьНаправленияПродаж()
	
	Мас = Новый Массив;
	Мас.Добавить(Справочники.НаправленияПродаж.Москва);
	Мас.Добавить(Справочники.НаправленияПродаж.Подмосковье);
	Мас.Добавить(Справочники.НаправленияПродаж.ЦентрРоссии);
	Мас.Добавить(Справочники.НаправленияПродаж.СеверЮг);
	Мас.Добавить(Справочники.НаправленияПродаж.НайтиПоКоду(18)); // "Юг"
	Мас.Добавить(Справочники.НаправленияПродаж.ИнтернетМагазины);
	Мас.Добавить(Справочники.НаправленияПродаж.НижнийНовгород);  // Поволжье
	Мас.Добавить(Справочники.НаправленияПродаж.Беларусь);
	Мас.Добавить(Справочники.НаправленияПродаж.БондаренкоКорпоративныеКлиенты);
	Мас.Добавить(Справочники.НаправленияПродаж.Конечники);
	Мас.Добавить(Справочники.НаправленияПродаж.Тендеры);
	Мас.Добавить(Справочники.НаправленияПродаж.ФилиалРнД);
	Мас.Добавить(Справочники.НаправленияПродаж.ФилиалСПб);
	Мас.Добавить(Справочники.НаправленияПродаж.ФилиалЕкб);
	
	Возврат Мас;
	
КонецФункции // ПолучитьНаправленияПродаж()

Функция ПолучитьДанные(Подразделения, ДнейПросрочки=13)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОтветственноеЛицо КАК Менеджер,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.Владелец КАК Контрагент,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорПродажи,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка.ДатаОтгрузки КАК ДатаОтгрузки,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка.ДатаОплаты КАК ДатаОплаты,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаДолга,
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаПросроченногоДолга,
	|	0 КАК НачислилиПеней,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ТипДоговора = &Пени
	|			ТОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ВыставилиПеней,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОтветственноеЛицо.ОсновноеПодразделение КАК Подразделение,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж КАК НаправлениеПродаж
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			,
	|			(ДоговорКонтрагента.ВидДоговора = &СПокупателем
	|				ИЛИ ДоговорКонтрагента.ВидДоговора = &СКомиссионером)
	|				И ДоговорКонтрагента.ОтветственноеЛицо.НаправлениеПродаж В (&НаправленияПродаж)) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Менеджер,
	|	вт.Контрагент,
	|	вт.ДоговорПродажи,
	|	вт.Сделка,
	|	вт.ДатаОтгрузки,
	|	вт.ДатаОплаты,
	|	СУММА(вт.СуммаДолга) КАК СуммаДолга,
	|	СУММА(вт.СуммаПросроченногоДолга) КАК СуммаПросроченногоДолга,
	|	СУММА(вт.НачислилиПеней) КАК НачислилиПеней,
	|	СУММА(вт.ВыставилиПеней) КАК ВыставилиПеней,
	|	вт.Подразделение,
	|	вт.НаправлениеПродаж
	|ПОМЕСТИТЬ свод
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	99=99
	|
	|СГРУППИРОВАТЬ ПО
	|	вт.Менеджер,
	|	вт.Контрагент,
	|	вт.ДоговорПродажи,
	|	вт.Сделка,
	|	вт.ДатаОтгрузки,
	|	вт.ДатаОплаты,
	|	вт.Подразделение,
	|	вт.НаправлениеПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка КАК Сделка,
	|	СУММА(ВЫБОР
	|			КОГДА &УчитыватьВзимныеОбязательства
	|				ТОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток - ЕСТЬNULL(УпрВзаимозачеты.Сумма, 0)
	|			ИНАЧЕ ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток
	|		КОНЕЦ) КАК СуммаУпрОстаток
	|ПОМЕСТИТЬ ПДЗ
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|			&ТекДата,
	|			(ДоговорКонтрагента.ВидДоговора = &СПокупателем
	|				ИЛИ ДоговорКонтрагента.ВидДоговора = &СКомиссионером)
	|				И Сделка.ДатаОплаты < &ТекДата) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УправленческийЗачетВзаимныхОбязательствСуммыДолга.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|			УправленческийЗачетВзаимныхОбязательствСуммыДолга.Сделка КАК Сделка,
	|			УправленческийЗачетВзаимныхОбязательствСуммыДолга.Сумма КАК Сумма
	|		ИЗ
	|			Документ.УправленческийЗачетВзаимныхОбязательств.СуммыДолга КАК УправленческийЗачетВзаимныхОбязательствСуммыДолга
	|		ГДЕ
	|			УправленческийЗачетВзаимныхОбязательствСуммыДолга.Ссылка.Проведен
	|			И УправленческийЗачетВзаимныхОбязательствСуммыДолга.ВидЗадолженности = ЗНАЧЕНИЕ(Перечисление.ВидыЗадолженности.Дебиторская)) КАК УпрВзаимозачеты
	|		ПО ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента = УпрВзаимозачеты.ДоговорКонтрагента
	|			И ВзаиморасчетыСКонтрагентамиОстатки.Сделка = УпрВзаимозачеты.Сделка
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	свод.Менеджер,
	|	свод.Контрагент,
	|	свод.Сделка,
	|	свод.ДатаОтгрузки,
	|	свод.ДатаОплаты,
	|	свод.СуммаДолга,
	|	ПДЗ.СуммаУпрОстаток КАК СуммаПросроченногоДолга,
	|	свод.НаправлениеПродаж,
	|	ВЫБОР
	|		КОГДА НЕ ПДЗ.Сделка ЕСТЬ NULL 
	|				И ЕСТЬNULL(ПДЗ.СуммаУпрОстаток, 0) > 0
	|			ТОГДА ВЫБОР
	|					КОГДА РАЗНОСТЬДАТ(ВЫБОР
	|								КОГДА ЕСТЬNULL(ПДЗ.Сделка.ДатаОплаты, 0) = 0
	|										ИЛИ ПДЗ.Сделка.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|									ТОГДА ПДЗ.Сделка.Дата
	|								ИНАЧЕ ПДЗ.Сделка.ДатаОплаты
	|							КОНЕЦ, &ТекДата, ДЕНЬ) + 1 > 0
	|						ТОГДА РАЗНОСТЬДАТ(ВЫБОР
	|									КОГДА ЕСТЬNULL(ПДЗ.Сделка.ДатаОплаты, 0) = 0
	|											ИЛИ ПДЗ.Сделка.ДатаОплаты = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|										ТОГДА ПДЗ.Сделка.Дата
	|									ИНАЧЕ ПДЗ.Сделка.ДатаОплаты
	|								КОНЕЦ, &ТекДата, ДЕНЬ) + 1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДнейПросрочено
	|ПОМЕСТИТЬ Итого
	|ИЗ
	|	свод КАК свод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПДЗ КАК ПДЗ
	|		ПО свод.Сделка = ПДЗ.Сделка
	|			И свод.ДоговорПродажи = ПДЗ.ДоговорКонтрагента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	зтИтогоОбъединен.Менеджер КАК Менеджер,
	|	зтИтогоОбъединен.Контрагент КАК Контрагент,
	|	МАКСИМУМ(зтИтогоОбъединен.СуммаПросроченногоДолга) КАК СуммаПросроченногоДолга,
	|	зтИтогоОбъединен.НаправлениеПродаж КАК НаправлениеПродаж,
	|	МАКСИМУМ(зтИтогоОбъединен.ДнейПросрочено) КАК ДнейПросрочено
	|ИЗ
	|	(ВЫБРАТЬ
	|		Итого.Менеджер КАК Менеджер,
	|		Итого.Контрагент КАК Контрагент,
	|		СУММА(Итого.СуммаПросроченногоДолга) КАК СуммаПросроченногоДолга,
	|		Итого.НаправлениеПродаж КАК НаправлениеПродаж,
	|		МАКСИМУМ(Итого.ДнейПросрочено) КАК ДнейПросрочено
	|	ИЗ
	|		Итого КАК Итого
	|	ГДЕ
	|		Итого.ДнейПросрочено > &ДнейПросрочки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Итого.Менеджер,
	|		Итого.Контрагент,
	|		Итого.НаправлениеПродаж
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Итого.Менеджер,
	|		Итого.Контрагент,
	|		СУММА(Итого.СуммаПросроченногоДолга),
	|		Итого.НаправлениеПродаж,
	|		МАКСИМУМ(Итого.ДнейПросрочено)
	|	ИЗ
	|		Итого КАК Итого
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Итого.Менеджер,
	|		Итого.Контрагент,
	|		Итого.НаправлениеПродаж
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(Итого.СуммаПросроченногоДолга) >= 500000) КАК зтИтогоОбъединен
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоследняяЗаписьПоСудам.Контрагент КАК Контрагент,
	|			СудебныеРазбирательстваСДебиторами.ДатаНачалаСудебногоПроцесса КАК ДатаНачалаСудебногоПроцесса
	|		ИЗ
	|			(ВЫБРАТЬ
	|				СудебныеРазбирательстваСДебиторами.Контрагент КАК Контрагент,
	|				МАКСИМУМ(СудебныеРазбирательстваСДебиторами.НомерЗаписи) КАК НомерЗаписи
	|			ИЗ
	|				РегистрСведений.СудебныеРазбирательстваСДебиторами КАК СудебныеРазбирательстваСДебиторами
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СудебныеРазбирательстваСДебиторами.Контрагент) КАК ПоследняяЗаписьПоСудам
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СудебныеРазбирательстваСДебиторами КАК СудебныеРазбирательстваСДебиторами
	|				ПО ПоследняяЗаписьПоСудам.Контрагент = СудебныеРазбирательстваСДебиторами.Контрагент
	|					И ПоследняяЗаписьПоСудам.НомерЗаписи = СудебныеРазбирательстваСДебиторами.НомерЗаписи) КАК зтСуды
	|		ПО зтИтогоОбъединен.Контрагент = зтСуды.Контрагент
	|ГДЕ
	|	зтСуды.ДатаНачалаСудебногоПроцесса ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	зтИтогоОбъединен.Менеджер,
	|	зтИтогоОбъединен.Контрагент,
	|	зтИтогоОбъединен.НаправлениеПродаж
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаправлениеПродаж,
	|	Менеджер,
	|	Контрагент
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	НаправленияПродаж = ПолучитьНаправленияПродаж();
	
	Если Подразделения.Количество()>0 тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"99=99","вт.Подразделение В(&Подразделения)");	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НаправленияПродаж"            , НаправленияПродаж);
	Запрос.УстановитьПараметр("Пени"                         , Справочники.ТипыДоговоров.Пени);
	Запрос.УстановитьПараметр("СПокупателем"                 , Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("СКомиссионером"               , Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	Запрос.УстановитьПараметр("УчитыватьВзимныеОбязательства", УчитыватьВзимныеОбязательства);
	Запрос.УстановитьПараметр("ТекДата"                      , Период);
	Запрос.УстановитьПараметр("ДнейПросрочки"                , ДнейПросрочки);
	Запрос.УстановитьПараметр("Подразделения"                , Подразделения);
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат Результат;
	
КонецФункции // ПолучитьДанные()

Процедура ПополнитьТелоПисьма(ТелоПисьма, Выборка)
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
		ТелоПисьма = ТелоПисьма + "<tr>"; 
		ТелоПисьма = ТелоПисьма + "<td>" + НомерСтроки + "</td>"; 
		ТелоПисьма = ТелоПисьма + "<td>" + Выборка.НаправлениеПродаж.Наименование + "</td>"; 
		ТелоПисьма = ТелоПисьма + "<td>" + Выборка.Менеджер.Наименование + "</td>"; 
		ТелоПисьма = ТелоПисьма + "<td>" + Выборка.Контрагент.Наименование + "</td>"; 
		ТелоПисьма = ТелоПисьма + "<td>" + Выборка.СуммаПросроченногоДолга + "</td>"; 
		ТелоПисьма = ТелоПисьма + "<td>" + Выборка.ДнейПросрочено + "</td>"; 
		ТелоПисьма = ТелоПисьма + "</tr>"+Символы.ПС;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // ПополнитьТелоПисьма()

Функция СформироватьТекстСообщения(Данные)
	
	ТелоПисьма = "";
	НомПП = 0; 
	
	ТелоПисьма = "<HTML><HEAD></HEAD><BODY>" + Символы.ПС; 
	ТелоПисьма = ТелоПисьма + "<META HTTP-EQUIV=""Content-Type"" CONTENT=""text/html; charset=windows-1251"">" + Символы.ПС; 
	ТелоПисьма = ТелоПисьма + "<h3>ПДЗ сроком 14 дней и более или суммой 500 т.р. и более, на " + СокрЛП(Период) + "</h3>" + Символы.ПС; 
	ТелоПисьма = ТелоПисьма + "<table border='1px'><th>№</th><th>Направл. продаж</th><th>Менеджер</th><th>Контрагент</th><th>Сумма ПДЗ</th><th>Дней просрочено</th>"+Символы.ПС; 
	
	Выборка = Данные[4].Выбрать();
	ПополнитьТелоПисьма(ТелоПисьма, Выборка);
	ТелоПисьма = ТелоПисьма + Символы.ПС + "</table>" + Символы.ПС;
	
	// {{ Решили делать одной таблицей
	//ТелоПисьма = ТелоПисьма + "<br />" + "<br />";
	//
	//ТелоПисьма = ТелоПисьма + "<h3>ПДЗ суммой 500 т.р. и более на "+СокрЛП(Период)+"</h3>"+ Символы.ПС; 
	//ТелоПисьма = ТелоПисьма + "<table border='1px'><th>№</th><th>Направл. продаж</th><th>Менеджер</th><th>Контрагент</th><th>Сумма ПДЗ</th><th>Дней просрочено</th>"+Символы.ПС; 
	//
	//Выборка = Данные[5].Выбрать();
	//ПополнитьТелоПисьма(ТелоПисьма, Выборка);
	//ТелоПисьма = ТелоПисьма + Символы.ПС+ "</table>"+Символы.ПС; 
	// }} Решили делать одной таблицей
	
	ТелоПисьма = ТелоПисьма + "</BODY></HTML>"; 
	
	Возврат ТелоПисьма;
	
КонецФункции // СформироватьТекстСообщения()

Процедура ОтравитьДанные(Данные, АдресПочты = "serkov@yst.ru")
	
	СписокФайловВложений = новый СписокЗначений;
	УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("no-reply@yst76.ru");
    Тема = "ПДЗ";
	ТекстСообщения = СформироватьТекстСообщения(Данные);
	
	ПослатьЭлектронноеПисьмоЛок(АдресПочты, СписокФайловВложений, УЗ, ТекстСообщения, Тема);
	
КонецПроцедуры // ОтравитьДанные()

Процедура ВыполнитьРассылкуОПДЗ() Экспорт
	//Серков
	Подразделения=новый СписокЗначений();
	Данные = ПолучитьДанные(Подразделения,13);
	ОтравитьДанные(Данные, "serkov@yst.ru");
	//ОтравитьДанные(Данные, "smirnov@yst.ru");
	
	//Марешева
	Подразделения=новый СписокЗначений();
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00112")); //Спб
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00106")); //РнД
	Подразделения.Добавить(Справочники.Подразделения.НайтиПоКоду("00138")); //Екат
	Данные = ПолучитьДанные(Подразделения,6);
	ОтравитьДанные(Данные, "maresheva@yst.ru");
	//ОтравитьДанные(Данные, "smirnov@yst.ru");
	
КонецПроцедуры // ВыполнитьРассылкуОПДЗ()

Процедура ПослатьЭлектронноеПисьмоЛок(АдресПолучателя, СписокФайловВложений, УЗ, ТекстСообщения = "", Тема = "", Отправитель="",Копии = "", Уведомления = Ложь)
	
	ИПП=Новый ИнтернетПочтовыйПрофиль;
	ИПП.АдресСервераSMTP=УЗ.SMTPСервер;
	ИПП.ПортSMTP=УЗ.ПортSMTP;
	Если УЗ.ТребуетсяSMTPАутентификация Тогда
		ИПП.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
		ИПП.ПарольSMTP         = УЗ.ПарольSMTP;
		ИПП.ПользовательSMTP   = УЗ.ЛогинSMTP;
	Иначе
		ИПП.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
		ИПП.ПарольSMTP         = "";
		ИПП.ПользовательSMTP   = "";
	КонецЕсли;
	Письмо=Новый ИнтернетПочтовоеСообщение;
	Письмо.Отправитель.Адрес 		   = ?(Отправитель="", УЗ.АдресЭлектроннойПочты, Отправитель);
	Письмо.Отправитель.ОтображаемоеИмя = ?(Отправитель="", УЗ.Наименование, 	     Отправитель);
	Если  Копии<>"" тогда
		Письмо.Копии.Добавить(Копии);
	КонецЕсли;
	
	// Сакулина
	 Если Уведомления = Истина Тогда
		 Письмо.УведомитьОДоставке = Истина;
		 Письмо.УведомитьОПрочтении = Истина;
		 Письмо.АдресаУведомленияОДоставке.Добавить(УЗ.АдресЭлектроннойПочты);
		 Письмо.АдресаУведомленияОПрочтении.Добавить(УЗ.АдресЭлектроннойПочты);
	 КонецЕсли;
	 //Сакулина
	 
	//+++( 19.12.2011 - разбор адреса на несколько адресов
	i = Найти(АдресПолучателя,";"); j=Найти(АдресПолучателя, ",");
	k=?(i>0 и i>j,  i, ?(j>0 и j>i, j, 0) );
	
	Если i=0 и j=0 тогда
		Письмо.Получатели.Добавить(АдресПолучателя);
	иначе
		АдрОстаток = СокрЛП(АдресПолучателя);
		пока (k>0) цикл
			Адр1 = Лев(АдрОстаток, k-1);
			Если СокрЛП(Адр1)<>"" и Найти(Адр1,"@")>0 и Найти(Адр1,".")>0 тогда
				Письмо.Получатели.Добавить(Адр1);
			КонецЕсли;
			АдрОстаток = Прав(АдрОстаток, стрДлина(АдрОстаток)-k);
			i = Найти(АдрОстаток,";"); j=Найти(АдрОстаток, ",");
			k=?(i>0 и i>j,  i, ?(j>0 и j>i, j, 0) );
		КонецЦикла;
		Если СокрЛП(АдрОстаток)<>"" и Найти(АдрОстаток,"@")>0 и Найти(АдрОстаток,".")>0 тогда
			Письмо.Получатели.Добавить(АдрОстаток);
		КонецЕсли;
		
	КонецЕсли; //+++ )
	
	Если ЗначениеЗаполнено(СписокФайловВложений) И СписокФайловВложений.Количество()>0 Тогда
		Для Каждого ТекАдр Из СписокФайловВложений Цикл
			Письмо.Вложения.Добавить(ТекАдр.Значение);
		КонецЦикла;
	КонецЕсли;
	//Письмо.АдресаУведомленияОДоставке.Добавить(УЗ.АдресЭлектроннойПочты);
	//Письмо.АдресаУведомленияОПрочтении.Добавить(УЗ.АдресЭлектроннойПочты);

	
	Письмо.Тема= Тема;
	Если УЗ.АдресЭлектроннойПочты = "formula.auto.plus@yandex.ru" Тогда
		Письмо.ИмяОтправителя ="ООО ""Формула Авто Плюс"", г.Ярославль";
		Письмо.Организация ="ООО ""Формула Авто Плюс"", г.Ярославль";
	Иначе
		
		Письмо.ИмяОтправителя ="ЗАО ТК ""Яршинторг"", г.Ярославль";
		Письмо.Организация ="ЗАО ТК ""Яршинторг"", г.Ярославль";
	КонецЕсли;
	
	Письмо.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.HTML);
	
	Почта=Новый ИнтернетПочта;
	попытка
		Почта.Подключиться(ИПП);
		Почта.Послать(Письмо);
		Почта.Отключиться();
		#Если Клиент Тогда
			сообщить(" >>>  Письмо отправлено на эл.адрес: "+АдресПолучателя+". "+строка(СписокФайловВложений.Количество())+" вложенных файлов...", СтатусСообщения.Информация);
		#КонецЕсли
	исключение
		Почта.Отключиться();
		#Если Клиент Тогда
			сообщить("xxxxx Ошибка при отправке письма на эл.адрес: "+АдресПолучателя+" - "+ОписаниеОшибки(), СтатусСообщения.Внимание);
		#КонецЕсли
	конецПопытки;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////
Период = ТекущаяДата();
